0/epsilon
FoamFile
{
	version	2.0;
	format	binary;
	class	volScalarField;
	location	"0";
	object	epsilon;
	arch	"LSB;label=32;scalar=64";
}
dimensions	[0 2 -3 0 0 0 0];
internalField	uniform 1.0;
boundaryField
{
	symmetry
	{
		type	symmetry;
	}
	cylinder
	{
		type	epsilonWallFunction;
		value	uniform 1.0;
	}
}
