0/nut
FoamFile
{
	version	2.0;
	format	binary;
	class	volScalarField;
	location	"0";
	object	nut;
	arch	"LSB;label=32;scalar=64";
}
dimensions	[0 2 -1 0 0 0 0];
internalField	uniform 0.10999999940395355;
boundaryField
{
	symmetry
	{
		type	symmetry;
	}
	cylinder
	{
		type	nutUWallFunction;
		value	uniform 0.10999999940395355;
	}
}
