0/p
FoamFile
{
	version	2.0;
	format	binary;
	class	volScalarField;
	location	"0";
	object	p;
	arch	"LSB;label=32;scalar=64";
}
dimensions	[1 -1 -2 0 0 0 0];
internalField	uniform 5000000.0;
boundaryField
{
	symmetry
	{
		type	symmetry;
	}
	cylinder
	{
		type	zeroGradient;
	}
}
