constant/polyMesh/boundary
FoamFile
{
	version	2.0;
	format	ascii;
	class	polyBoundaryMesh;
	location	"constant/polyMesh";
	object	boundary;
}
2
(
	symmetry
	{
		type	symmetry;
		startFace	111261;
		nFaces	1960;
	}
	cylinder
	{
		type	wall;
		startFace	113221;
		nFaces	5218;
	}
)